zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/clock/gd32_rcu_f4xx.h
/*
 * Copyright (c) 2022 Teslabs Engineering S.L.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32_RCU_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32_RCU_H_

/**
 * Encode RCU register offset and configuration bit.
 *
 * - 0..5: bit number
 * - 6..14: offset
 * - 15: reserved
 *
 * @param reg RCU register name (expands to GD32_{reg}_OFFSET)
 * @param bit Configuration bit
 */
#define GD32_RCU_CONFIG(reg, bit) \
	(((GD32_ ## reg ## _OFFSET) << 6U) | (bit))

/**
 * @name Register offsets
 * @{
 */

#define GD32_AHB1EN_OFFSET       0x30U
#define GD32_AHB2EN_OFFSET       0x34U
#define GD32_AHB3EN_OFFSET       0x38U
#define GD32_APB1EN_OFFSET       0x40U
#define GD32_APB2EN_OFFSET       0x44U
#define GD32_ADDAPB1EN_OFFSET    0xE4U

/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB1 peripherals */
#define GD32_RCU_GPIOA      GD32_RCU_CONFIG(AHB1EN, 0U)
#define GD32_RCU_GPIOB      GD32_RCU_CONFIG(AHB1EN, 1U)
#define GD32_RCU_GPIOC      GD32_RCU_CONFIG(AHB1EN, 2U)
#define GD32_RCU_GPIOD      GD32_RCU_CONFIG(AHB1EN, 3U)
#define GD32_RCU_GPIOE      GD32_RCU_CONFIG(AHB1EN, 4U)
#define GD32_RCU_GPIOF      GD32_RCU_CONFIG(AHB1EN, 5U)
#define GD32_RCU_GPIOG      GD32_RCU_CONFIG(AHB1EN, 6U)
#define GD32_RCU_GPIOH      GD32_RCU_CONFIG(AHB1EN, 7U)
#define GD32_RCU_GPIOI      GD32_RCU_CONFIG(AHB1EN, 8U)
#define GD32_RCU_CRC        GD32_RCU_CONFIG(AHB1EN, 12U)
#define GD32_RCU_BKPSRAM    GD32_RCU_CONFIG(AHB1EN, 18U)
#define GD32_RCU_TCMSRAM    GD32_RCU_CONFIG(AHB1EN, 20U)
#define GD32_RCU_DMA0       GD32_RCU_CONFIG(AHB1EN, 21U)
#define GD32_RCU_DMA1       GD32_RCU_CONFIG(AHB1EN, 22U)
#define GD32_RCU_IPA        GD32_RCU_CONFIG(AHB1EN, 23U)
#define GD32_RCU_ENET       GD32_RCU_CONFIG(AHB1EN, 25U)
#define GD32_RCU_ENETTX     GD32_RCU_CONFIG(AHB1EN, 26U)
#define GD32_RCU_ENETRX     GD32_RCU_CONFIG(AHB1EN, 27U)
#define GD32_RCU_ENETPTP    GD32_RCU_CONFIG(AHB1EN, 28U)
#define GD32_RCU_USBHS      GD32_RCU_CONFIG(AHB1EN, 29U)
#define GD32_RCU_USBHSULPI  GD32_RCU_CONFIG(AHB1EN, 30U)

/* AHB2 peripherals */
#define GD32_RCU_DCI        GD32_RCU_CONFIG(AHB2EN, 0U)
#define GD32_RCU_TRNG       GD32_RCU_CONFIG(AHB2EN, 6U)
#define GD32_RCU_USBFS      GD32_RCU_CONFIG(AHB2EN, 7U)

/* AHB3 peripherals */
#define GD32_RCU_EXMC       GD32_RCU_CONFIG(AHB3EN, 0U)

/* APB1 peripherals */
#define GD32_RCU_TIMER1     GD32_RCU_CONFIG(APB1EN, 0U)
#define GD32_RCU_TIMER2     GD32_RCU_CONFIG(APB1EN, 1U)
#define GD32_RCU_TIMER3     GD32_RCU_CONFIG(APB1EN, 2U)
#define GD32_RCU_TIMER4     GD32_RCU_CONFIG(APB1EN, 3U)
#define GD32_RCU_TIMER5     GD32_RCU_CONFIG(APB1EN, 4U)
#define GD32_RCU_TIMER6     GD32_RCU_CONFIG(APB1EN, 5U)
#define GD32_RCU_TIMER11    GD32_RCU_CONFIG(APB1EN, 6U)
#define GD32_RCU_TIMER12    GD32_RCU_CONFIG(APB1EN, 7U)
#define GD32_RCU_TIMER13    GD32_RCU_CONFIG(APB1EN, 8U)
#define GD32_RCU_WWDGT      GD32_RCU_CONFIG(APB1EN, 11U)
#define GD32_RCU_SPI1       GD32_RCU_CONFIG(APB1EN, 14U)
#define GD32_RCU_SPI2       GD32_RCU_CONFIG(APB1EN, 15U)
#define GD32_RCU_USART1     GD32_RCU_CONFIG(APB1EN, 17U)
#define GD32_RCU_USART2     GD32_RCU_CONFIG(APB1EN, 18U)
#define GD32_RCU_UART3      GD32_RCU_CONFIG(APB1EN, 19U)
#define GD32_RCU_UART4      GD32_RCU_CONFIG(APB1EN, 20U)
#define GD32_RCU_I2C0       GD32_RCU_CONFIG(APB1EN, 21U)
#define GD32_RCU_I2C1       GD32_RCU_CONFIG(APB1EN, 22U)
#define GD32_RCU_I2C2       GD32_RCU_CONFIG(APB1EN, 23U)
#define GD32_RCU_CAN0       GD32_RCU_CONFIG(APB1EN, 25U)
#define GD32_RCU_CAN1       GD32_RCU_CONFIG(APB1EN, 26U)
#define GD32_RCU_PMU        GD32_RCU_CONFIG(APB1EN, 28U)
#define GD32_RCU_DAC        GD32_RCU_CONFIG(APB1EN, 29U)
#define GD32_RCU_UART6      GD32_RCU_CONFIG(APB1EN, 30U)
#define GD32_RCU_UART7      GD32_RCU_CONFIG(APB1EN, 31U)
#define GD32_RCU_RTC        GD32_RCU_CONFIG(BDCTL, 15U)

/* APB2 peripherals */
#define GD32_RCU_TIMER0     GD32_RCU_CONFIG(APB2EN, 0U)
#define GD32_RCU_TIMER7     GD32_RCU_CONFIG(APB2EN, 1U)
#define GD32_RCU_USART0     GD32_RCU_CONFIG(APB2EN, 4U)
#define GD32_RCU_USART5     GD32_RCU_CONFIG(APB2EN, 5U)
#define GD32_RCU_ADC0       GD32_RCU_CONFIG(APB2EN, 8U)
#define GD32_RCU_ADC1       GD32_RCU_CONFIG(APB2EN, 9U)
#define GD32_RCU_ADC2       GD32_RCU_CONFIG(APB2EN, 10U)
#define GD32_RCU_SDIO       GD32_RCU_CONFIG(APB2EN, 11U)
#define GD32_RCU_SPI0       GD32_RCU_CONFIG(APB2EN, 12U)
#define GD32_RCU_SPI3       GD32_RCU_CONFIG(APB2EN, 13U)
#define GD32_RCU_SYSCFG     GD32_RCU_CONFIG(APB2EN, 14U)
#define GD32_RCU_TIMER8     GD32_RCU_CONFIG(APB2EN, 16U)
#define GD32_RCU_TIMER9     GD32_RCU_CONFIG(APB2EN, 17U)
#define GD32_RCU_TIMER10    GD32_RCU_CONFIG(APB2EN, 18U)
#define GD32_RCU_SPI4       GD32_RCU_CONFIG(APB2EN, 20U)
#define GD32_RCU_SPI5       GD32_RCU_CONFIG(APB2EN, 21U)
#define GD32_RCU_TLI        GD32_RCU_CONFIG(APB2EN, 26U)

/* APB1 additional peripherals */
#define GD32_RCU_CTC        GD32_RCU_CONFIG(ADDAPB1EN, 27U)
#define GD32_RCU_IREF       GD32_RCU_CONFIG(ADDAPB1EN, 31U)

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32_RCU_H_ */
